
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.НачалоПериода = НачалоНедели(ТекущаяДата());
	Объект.КонецПериода  = КонецНедели(ТекущаяДата());
	
	Период.ДатаНачала    = Объект.НачалоПериода;
	Период.ДатаОкончания = Объект.КонецПериода;
	
	
	СоздатьДиаграмму();
	
КонецПроцедуры

 &НаСервере
Процедура СоздатьДиаграмму()

	 	
	ДГ.Очистить();
	ДГ.Обновление = Ложь;
	ДГ.ОтображатьЛегенду = Ложь;
	ДГ.АвтоОпределениеПолногоИнтервала = Истина;
	ДГ.ОбластьПостроения.ЛинииСвязей = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная,2);
	ДГ.ОтображениеИнтервала = ОтображениеИнтервалаДиаграммыГанта.Объемный;
	
	ДГ.ОтображениеТекстаЗначения = ОтображениеТекстаЗначенияДиаграммыГанта.Право;
	//ДГ.ОбластьПостроения.Право = 0;
	ДГ.ОбластьПостроения.Лево = 0;
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", Объект.КонецПериода);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадачаОбсуждения.Ссылка.Исполнитель КАК Исполнитель,
	|	ЗадачаОбсуждения.ДатаНачала КАК ДатаНачала,
	|	ЗадачаОбсуждения.ДатаОкончания,
	|	ЗадачаОбсуждения.Ссылка.ТемаЗадачи КАК ТемаЗадачи,
	|	ЗадачаОбсуждения.Ссылка
	|ИЗ
	|	Документ.VIP2_Задача.Обсуждения КАК ЗадачаОбсуждения
	|ГДЕ
	|	ЗадачаОбсуждения.ДатаНачала МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаНачала
	|ИТОГИ ПО
	|	Исполнитель";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаИсполнитель = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	
	// Создаем таблицу значений, в которую, по мере обхода запроса, будем заносить связи.
	Связи = Новый ТаблицаЗначений;
	Связи.Колонки.Добавить("Конец");
	Связи.Колонки.Добавить("Начало");

	
	// Серия будет одна.
	Серия = Дг.Серии.Добавить();
	
	Пока ВыборкаИсполнитель.Следующий() Цикл
		
		Выборка =  ВыборкаИсполнитель.Выбрать();
		
		ТочкаИсполнитель = ДГ.УстановитьТочку(ВыборкаИсполнитель.Исполнитель);
		
		Предшествующая = Неопределено;
		ПредшествующаяДата = Неопределено;
		
		Пока Выборка.Следующий() Цикл
					
			Точка = ДГ.УстановитьТочку(Выборка.ТемаЗадачи, ВыборкаИсполнитель.Исполнитель);
			
			Точка.Расшифровка = Выборка.Ссылка;
			
 			Значение = ДГ.ПолучитьЗначение(Точка, Серия);
			
			Интервал = Значение.Добавить();
			
			Интервал.Начало = Выборка.ДатаНачала;
			
			Интервал.Конец = Выборка.ДатаОкончания;
			
			Интервал.Текст = Выборка.ТемаЗадачи;
			
			Интервал.Расшифровка  = Выборка.Ссылка;
			
			
			Если Предшествующая <> Неопределено
				и Предшествующая <> Выборка.ТемаЗадачи
				и ДеньГода(Выборка.ДатаНачала) = ДеньГода(ПредшествующаяДата)
				Тогда
 				Связь = Связи.Добавить();
				Связь.Начало = Предшествующая;
				Связь.Конец  = Выборка.ТемаЗадачи;
 			КонецЕсли;

			Предшествующая = Выборка.ТемаЗадачи;
			ПредшествующаяДата =  Выборка.ДатаОкончания;
			
		КонецЦикла;
		
	КонецЦикла;
	
//	СоздатьСвязи(Связи, ДГ, Серия);


	
	// Развертываем первую точку. Это, разумеется, довольно условный код.
	Если ДГ.Точки.Количество() > 0 Тогда
		ДГ.РазвернутьТочку(ДГ.Точки.Получить(0), Истина);
	КонецЕсли;

	
	ДГ.Обновление = Истина;


КонецПроцедуры // СоздатьДиаграмму()


&НаСервере
Процедура СоздатьСвязи(Связи, Диаграмма, Серия)
	
	ТекущаяТочка = NULL;
	Для Каждого Связь Из Связи Цикл 
		Если ТекущаяТочка = NULL Или ТекущаяТочка.Значение <> Связь.Конец Тогда
			ТекущаяТочка = Диаграмма.УстановитьТочку(Связь.Конец);
		КонецЕсли;
		
		ТочкаНачала = Диаграмма.УстановитьТочку(Связь.Начало);
		Значение = Диаграмма.ПолучитьЗначение(ТочкаНачала, Серия);
		Для Каждого Интервал Из Значение Цикл
			ИнтервалНачала = Интервал;
			Прервать;
		КонецЦикла;
		Значение = Диаграмма.ПолучитьЗначение(ТекущаяТочка, Серия);
		Для Каждого Интервал Из Значение Цикл
			ИнтервалКонца = Интервал;
			Прервать;
		КонецЦикла;
		Связь = ИнтервалНачала.Добавить(ИнтервалКонца);
		Если ИнтервалНачала.Конец <= ИнтервалКонца.Начало Тогда
			Связь.Цвет = WebЦвета.Синий;
		Иначе			
			Связь.Цвет = WebЦвета.Красный;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // СоздатьСвязи(Связи, Диаграмма, Серия)




&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.НачалоПериода = Период.ДатаНачала;
	Объект.КонецПериода  = Период.ДатаОкончания;
	
	СоздатьДиаграмму();

КонецПроцедуры

