

&НаКлиенте
Процедура ОбсужденияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	
	
	Если НоваяСтрока И НЕ Копирование Тогда
		
		Элемент.ТекущиеДанные.ДатаНачала = ТекущаяДата();
		Элемент.ТекущиеДанные.ДатаОкончания = ТекущаяДата();
 	
	КонецЕсли;
	

	
КонецПроцедуры


&НаКлиенте
Процедура ОбсужденияДатаНачалаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Обсуждения.ТекущиеДанные;

	РассчитатьЧасы(ТекущаяСтрока);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбсужденияДатаОкончанияПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Обсуждения.ТекущиеДанные;

	РассчитатьЧасы(ТекущаяСтрока);
	
КонецПроцедуры

 &НаКлиенте
Процедура РассчитатьЧасы(ТекущаяСтрока)

	ТекущаяСтрока.Часы = (ТекущаяСтрока.ДатаОкончания - ТекущаяСтрока.ДатаНачала)  / 3600;

КонецПроцедуры // РассчитатьЧасы()
